In [ ]:
'I am a boy'

In [ ]:
"I am a boy"

In [ ]:
'I'm a boy'

In [ ]:
"I'm a boy"

In [ ]:
# 이스케이프: 메타문자의 기능을 해제하는 메타문자
'I\'m a boy'

In [ ]:
'C:\\Users\\USER\\Documents\\project\\data'

In [ ]:
'C:/Users/USER/Documents/project/data'

In [ ]:
# raw string: 문자열 안에 있는 모든 메타문자의 기능을 일괄 해제
r'C:\Users\USER\Documents\project\data'

!pip install chardet

In [ ]:
import os
import numpy as np
import pandas as pd
import chardet

In [ ]:
pd.__version__

In [ ]:
np.__version__

In [ ]:
os.getcwd()

In [ ]:
# 절대 경로 방식
os.chdir(path = 'C:\\Users\\USER\\Documents\\project\\data')
os.getcwd()

In [ ]:
# 상대 경로 방식: '.'(현재 폴더), '..'(부모 폴더)
os.chdir(path = '..')
os.getcwd()

In [ ]:
os.chdir(path = './code')
os.getcwd()

In [ ]:
os.chdir(path = '../data')
os.getcwd()

In [ ]:
# 탐색기에서 복사한 절대 경로
os.chdir(path = r'C:\Users\USER\Documents\project\data')
os.getcwd()

In [ ]:
os.mkdir(path = 'temp')

In [ ]:
os.listdir()

In [ ]:
os.rmdir(path = 'temp')

In [ ]:
files = os.listdir()

In [ ]:
for file in files:
    if 'xlsx' in file:
        print(file)

In [ ]:
result = []
for file in files:
    if 'xlsx' in file:
        result.append(file)

In [ ]:
result

In [ ]:
# 리스트 컴프리헨션: [원소 for 변수 in 범위 if 조건]
result = [file for file in files if 'xlsx' in file]
result

In [ ]:
[i for i in range(10)]

In [ ]:
[i for i in range(10) if i % 2 == 0]

In [ ]:
# 삼항 연산자: 값1 if 조건 else 값2
[i if i % 2 == 0 else '홀수' for i in range(10)]

!pip install openpyxl xlrd

In [ ]:
pd.read_excel('APT_Price_Seoul(2020~2024).xlsx')

In [ ]:
%%time
dfs = pd.read_excel(io = 'APT_Price_Seoul(2020~2024).xlsx', 
                    sheet_name = None, 
                    usecols = range(1, 16), 
                    # usecols = ['거래금액', '지역코드']
                    skiprows = 3, 
                    thousands = ',')

In [ ]:
dfs

In [ ]:
dfs.keys()

In [ ]:
df1 = pd.DataFrame()
for key in dfs.keys():
    df = dfs[key]
    df1 = pd.concat(objs = [df1, df])

In [ ]:
df1.shape

In [ ]:
df1 = pd.concat(objs = dfs, ignore_index = True)

In [ ]:
df8 = pd.DataFrame(data = {'A': [1, 3, 5], 'B': [2, 4, 6]})
df9 = pd.DataFrame(data = {'A': [11, 13, 15], 'B': [12, 14, 16]})

In [ ]:
pd.concat(objs = [df8, df9], ignore_index = True)

In [ ]:
pd.concat(objs = [df8, df9], axis = 1, ignore_index = True)

In [ ]:
df1.info()

In [ ]:
%time df1.to_excel('test.xlsx', index = False)

In [ ]:
df1

In [ ]:
df1.head()

In [ ]:
df1.tail()

In [ ]:
df1.sample(random_state = 1234)

In [ ]:
df1.sample(random_state = 1234)

In [ ]:
files = os.listdir()

In [ ]:
files = [file for file in files if 'csv' in file and 'Price' in file]
files

In [ ]:
pd.read_csv(files[0])

In [ ]:
%%time
df2 = pd.DataFrame()
for file in files:
    df = pd.read_csv(filepath_or_buffer = file, encoding = 'CP949', 
                     parse_dates = ['등기일자'], thousands = ',')
    df2 = pd.concat(objs = [df2, df], ignore_index = True)

In [ ]:
df2.info()

In [ ]:
with open(file = files[0], mode = 'rb') as file:
    text = file.read()

In [ ]:
text[:100]

In [ ]:
%time chardet.detect(text[:100])

In [ ]:
%time chardet.detect(text)

In [ ]:
%time df2.to_csv('test.csv', index = False)

In [ ]:
%time df3 = pd.read_csv('test.csv')

In [ ]:
%time df3 = pd.read_csv('test.csv', low_memory = False)

In [ ]:
df3.head()

In [ ]:
df3.info()

In [ ]:
%time df2.to_pickle('test.pkl')

In [ ]:
%time df4 = pd.read_pickle('test.pkl')

In [ ]:
df4.info()

In [ ]:
os.rename(src = 'test.pkl', dst = 'APT_List.pkl')

In [ ]:
a = 1
b = 2.0
c = '3'

In [ ]:
pd.to_pickle(obj = [a, b, c], filepath_or_buffer = 'testAll.pkl')

In [ ]:
pd.read_pickle(filepath_or_buffer = 'testAll.pkl')

In [ ]:
a_1, b_1, c_1 = pd.read_pickle(filepath_or_buffer = 'testAll.pkl')

In [ ]:
print(a_1)
print(b_1)
print(c_1)

In [ ]:
os.listdir()

In [ ]:
files = [file for file in os.listdir() if 'test' in file]
files

In [ ]:
for file in files:
    os.remove(file)

In [ ]:
os.listdir()

In [ ]:
files = [file for file in os.listdir() if 'csv' in file and 'Price' in file]

In [ ]:
files = pd.Series(files)

In [ ]:
years = files.str.extract(pat = r'(\d+)')[0]

In [ ]:
for file, year in zip(files, years):
    print(file, year)

In [ ]:
df5 = pd.DataFrame()
for file, year in zip(files, years):
    df = pd.read_csv(file, encoding = 'CP949')
    df.insert(loc = 0, column = '거래년도', value = year)
    df5 = pd.concat(objs = [df5, df], ignore_index = True)

In [ ]:
df5.head()

In [1]:
import os
import numpy as np
import pandas as pd

In [2]:
os.getcwd()

'C:\\Users\\USER\\Documents\\project\\code'

In [3]:
os.chdir(path = '../data')

In [4]:
os.listdir()

['APT_Detail_Seoul_2024.csv',
 'APT_Detail_Seoul_2024.xlsx',
 'APT_List.pkl',
 'APT_Price_Seoul(2020~2024).xlsx',
 'APT_Price_Seoul_2020.csv',
 'APT_Price_Seoul_2021.csv',
 'APT_Price_Seoul_2022.csv',
 'APT_Price_Seoul_2023.csv',
 'APT_Price_Seoul_2024.csv',
 'NA_Sample.xlsx']

In [5]:
apt = pd.read_pickle('APT_List.pkl')

In [6]:
apt.head()

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,등기일자,매도자,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,NaT,NaN,39.53,13
1,203000,11680,개포자이,서울특별시,강남구,개포동,12-2,2004,2020,1,6,NaT,NaN,134.30,17
2,180000,11680,개포주공6단지,서울특별시,강남구,개포동,185,1983,2020,1,14,NaT,NaN,60.13,14
3,285000,11680,디에이치아너힐즈,서울특별시,강남구,개포동,1281,2019,2020,1,4,NaT,NaN,94.29,12
4,171000,11680,개포주공7단지,서울특별시,강남구,개포동,185,1983,2020,1,12,NaT,NaN,60.76,2

In [7]:
apt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231904 entries, 0 to 231903
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   거래금액    231904 non-null  int64
 1   지역코드    231904 non-null  int64
 2   아파트     231904 non-null  object
 3   시도명     231904 non-null  object
 4   시군구     231904 non-null  object
 5   법정동     231904 non-null  object
 6   지번      231904 non-null  object
 7   건축년도    231904 non-null  int64
 8   년       231904 non-null  int64
 9   월       231904 non-null  int64
 10  일       231904 non-null  int64
 11  등기일자    79535 non-null   datetime64[ns]
 12  매도자     56193 non-null   object
 13  전용면적    231904 non-null  float64
 14  층       231904 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(7), object(6)
memory usage: 26.5+ MB

In [8]:
apt.isna()

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,등기일자,매도자,전용면적,층
0,False,False,False,False,False,False,False,False,False,False,False,True,True,False,False
1,False,False,False,False,False,False,False,False,False,False,False,True,True,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,True,False,False
3,False,False,False,False,False,False,False,False,False,False,False,True,True,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,True,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
231899,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
231900,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
231901,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
231902,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
231903,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [9]:
apt.isna().sum()

거래금액         0
지역코드         0
아파트          0
시도명          0
시군구          0
법정동          0
지번           0
건축년도         0
년            0
월            0
일            0
등기일자    152369
매도자     175711
전용면적         0
층            0
dtype: int64

In [11]:
apt.isna().mean() * 100

거래금액     0.000000
지역코드     0.000000
아파트      0.000000
시도명      0.000000
시군구      0.000000
법정동      0.000000
지번       0.000000
건축년도     0.000000
년        0.000000
월        0.000000
일        0.000000
등기일자    65.703481
매도자     75.768853
전용면적     0.000000
층        0.000000
dtype: float64

In [12]:
cond = apt['등기일자'].isna()
apt.loc[cond, :]

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,등기일자,매도자,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,NaT,NaN,39.53,13
1,203000,11680,개포자이,서울특별시,강남구,개포동,12-2,2004,2020,1,6,NaT,NaN,134.30,17
2,180000,11680,개포주공6단지,서울특별시,강남구,개포동,185,1983,2020,1,14,NaT,NaN,60.13,14
3,285000,11680,디에이치아너힐즈,서울특별시,강남구,개포동,1281,2019,2020,1,4,NaT,NaN,94.29,12
4,171000,11680,개포주공7단지,서울특별시,강남구,개포동,185,1983,2020,1,12,NaT,NaN,60.76,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
231896,66500,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,11,9,NaT,개인,59.76,17
231897,59500,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,11,8,NaT,개인,59.76,1
231898,68500,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,11,14,NaT,개인,59.76,15
231902,67000,11260,한신아파트상가동유치원동(102~102),서울특별시,중랑구,중화동,450,1998,2024,11,2,NaT,개인,59.76,9
231903,11000,11260,범양프레체,서울특별시,중랑구,중화동,208-4,2012,2024,12,7,NaT,개인,17.94,15

In [14]:
apt['등기일자'].fillna(value = '1900-01-01')

0        1900-01-01
1        1900-01-01
2        1900-01-01
3        1900-01-01
4        1900-01-01
            ...
231899   2024-12-13
231900   2024-12-18
231901   2024-11-20
231902   1900-01-01
231903   1900-01-01
Name: 등기일자, Length: 231904, dtype: datetime64[ns]

In [15]:
apt.dropna()

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,등기일자,매도자,전용면적,층
175711,219000,11680,디에이치아너힐즈,서울특별시,강남구,개포동,1281,2019,2024,1,30,2024-04-30,개인,59.8732,17
175712,175000,11680,개포주공7단지,서울특별시,강남구,개포동,185,1983,2024,1,31,2024-03-20,개인,53.4600,5
175713,200000,11680,래미안블레스티지,서울특별시,강남구,개포동,1280,2019,2024,1,27,2024-02-29,개인,59.9670,9
175715,282000,11680,현대2,서울특별시,강남구,개포동,654,1986,2024,1,19,2024-05-30,개인,131.8300,1
175716,260000,11680,현대아파트3,서울특별시,강남구,개포동,177,1986,2024,1,20,2024-03-21,개인,131.8300,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
231888,64300,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,10,26,2025-01-02,개인,59.7600,7
231890,63000,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,10,27,2024-11-12,개인,59.7600,25
231899,74000,11260,한신아파트상가동유치원동(102~102),서울특별시,중랑구,중화동,450,1998,2024,11,21,2024-12-13,개인,84.0300,11
231900,50500,11260,삼익아파트.상가동,서울특별시,중랑구,중화동,438,1995,2024,11,13,2024-12-18,개인,59.3400,10
231901,60000,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,11,18,2024-11-20,개인,59.7600,4

In [16]:
apt.dropna(axis = 1)

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,39.53,13
1,203000,11680,개포자이,서울특별시,강남구,개포동,12-2,2004,2020,1,6,134.30,17
2,180000,11680,개포주공6단지,서울특별시,강남구,개포동,185,1983,2020,1,14,60.13,14
3,285000,11680,디에이치아너힐즈,서울특별시,강남구,개포동,1281,2019,2020,1,4,94.29,12
4,171000,11680,개포주공7단지,서울특별시,강남구,개포동,185,1983,2020,1,12,60.76,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
231899,74000,11260,한신아파트상가동유치원동(102~102),서울특별시,중랑구,중화동,450,1998,2024,11,21,84.03,11
231900,50500,11260,삼익아파트.상가동,서울특별시,중랑구,중화동,438,1995,2024,11,13,59.34,10
231901,60000,11260,한신아파트상가동유치원동(103~109),서울특별시,중랑구,중화동,450,1997,2024,11,18,59.76,4
231902,67000,11260,한신아파트상가동유치원동(102~102),서울특별시,중랑구,중화동,450,1998,2024,11,2,59.76,9
231903,11000,11260,범양프레체,서울특별시,중랑구,중화동,208-4,2012,2024,12,7,17.94,15

In [17]:
apt = apt.dropna(axis = 1)

In [18]:
apt.shape

(231904, 13)

In [19]:
os.listdir()

['APT_Detail_Seoul_2024.csv',
 'APT_Detail_Seoul_2024.xlsx',
 'APT_List.pkl',
 'APT_Price_Seoul(2020~2024).xlsx',
 'APT_Price_Seoul_2020.csv',
 'APT_Price_Seoul_2021.csv',
 'APT_Price_Seoul_2022.csv',
 'APT_Price_Seoul_2023.csv',
 'APT_Price_Seoul_2024.csv',
 'NA_Sample.xlsx']

In [20]:
na = pd.read_excel('NA_Sample.xlsx')

In [21]:
na

    구분 항목    값
0    A  a  1.2
1  NaN  b  2.3
2  NaN  c  3.5
3    B  a  1.7
4  NaN  b  2.6
5  NaN  c  3.6

In [22]:
na.ffill()

  구분 항목    값
0  A  a  1.2
1  A  b  2.3
2  A  c  3.5
3  B  a  1.7
4  B  b  2.6
5  B  c  3.6

In [23]:
na.bfill()

    구분 항목    값
0    A  a  1.2
1    B  b  2.3
2    B  c  3.5
3    B  a  1.7
4  NaN  b  2.6
5  NaN  c  3.6

In [26]:
na.loc[2, '값'] = np.nan

In [27]:
na

    구분 항목    값
0    A  a  1.2
1  NaN  b  2.3
2  NaN  c  NaN
3    B  a  1.7
4  NaN  b  2.6
5  NaN  c  3.6

In [28]:
na['값'].mean()

np.float64(2.2800000000000002)

In [30]:
na['값'] = na['값'].fillna(value = na['값'].mean())

In [31]:
na

    구분 항목     값
0    A  a  1.20
1  NaN  b  2.30
2  NaN  c  2.28
3    B  a  1.70
4  NaN  b  2.60
5  NaN  c  3.60

In [32]:
apt.head()

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,39.53,13
1,203000,11680,개포자이,서울특별시,강남구,개포동,12-2,2004,2020,1,6,134.30,17
2,180000,11680,개포주공6단지,서울특별시,강남구,개포동,185,1983,2020,1,14,60.13,14
3,285000,11680,디에이치아너힐즈,서울특별시,강남구,개포동,1281,2019,2020,1,4,94.29,12
4,171000,11680,개포주공7단지,서울특별시,강남구,개포동,185,1983,2020,1,12,60.76,2

In [34]:
# apt['지역코드']
apt.loc[:, '지역코드']

0         11680
1         11680
2         11680
3         11680
4         11680
          ...
231899    11260
231900    11260
231901    11260
231902    11260
231903    11260
Name: 지역코드, Length: 231904, dtype: int64

In [36]:
# apt[['거래금액', '지역코드']]
apt.loc[:, ['거래금액', '지역코드']]

          거래금액   지역코드
0       100500  11680
1       203000  11680
2       180000  11680
3       285000  11680
4       171000  11680
...        ...    ...
231899   74000  11260
231900   50500  11260
231901   60000  11260
231902   67000  11260
231903   11000  11260

[231904 rows x 2 columns]

In [37]:
apt[['지역코드', '거래금액']]

         지역코드    거래금액
0       11680  100500
1       11680  203000
2       11680  180000
3       11680  285000
4       11680  171000
...       ...     ...
231899  11260   74000
231900  11260   50500
231901  11260   60000
231902  11260   67000
231903  11260   11000

[231904 rows x 2 columns]

In [39]:
apt[['거래금액', '지역코드', '아파트', '시도명']]

          거래금액   지역코드                    아파트    시도명
0       100500  11680                삼익대청아파트  서울특별시
1       203000  11680                   개포자이  서울특별시
2       180000  11680                개포주공6단지  서울특별시
3       285000  11680               디에이치아너힐즈  서울특별시
4       171000  11680                개포주공7단지  서울특별시
...        ...    ...                    ...    ...
231899   74000  11260  한신아파트상가동유치원동(102~102)  서울특별시
231900   50500  11260              삼익아파트.상가동  서울특별시
231901   60000  11260  한신아파트상가동유치원동(103~109)  서울특별시
231902   67000  11260  한신아파트상가동유치원동(102~102)  서울특별시
231903   11000  11260                  범양프레체  서울특별시

[231904 rows x 4 columns]

In [41]:
# apt['거래금액':'시도명']
apt.loc[:, '거래금액':'시도명']

          거래금액   지역코드                    아파트    시도명
0       100500  11680                삼익대청아파트  서울특별시
1       203000  11680                   개포자이  서울특별시
2       180000  11680                개포주공6단지  서울특별시
3       285000  11680               디에이치아너힐즈  서울특별시
4       171000  11680                개포주공7단지  서울특별시
...        ...    ...                    ...    ...
231899   74000  11260  한신아파트상가동유치원동(102~102)  서울특별시
231900   50500  11260              삼익아파트.상가동  서울특별시
231901   60000  11260  한신아파트상가동유치원동(103~109)  서울특별시
231902   67000  11260  한신아파트상가동유치원동(102~102)  서울특별시
231903   11000  11260                  범양프레체  서울특별시

[231904 rows x 4 columns]

In [43]:
apt.head(n = 1)

     거래금액   지역코드      아파트    시도명  시군구  법정동  지번  건축년도     년  월   일   전용면적   층
0  100500  11680  삼익대청아파트  서울특별시  강남구  개포동  12  1992  2020  1  31  39.53  13

In [42]:
apt.loc[0, :]

거래금액     100500
지역코드      11680
아파트     삼익대청아파트
시도명       서울특별시
시군구         강남구
법정동         개포동
지번           12
건축년도       1992
년          2020
월             1
일            31
전용면적      39.53
층            13
Name: 0, dtype: object

In [44]:
apt.loc[[0, 231903], :]

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,39.53,13
231903,11000,11260,범양프레체,서울특별시,중랑구,중화동,208-4,2012,2024,12,7,17.94,15

In [45]:
apt.iloc[[0, -1], :]

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,39.53,13
231903,11000,11260,범양프레체,서울특별시,중랑구,중화동,208-4,2012,2024,12,7,17.94,15

In [46]:
apt.loc[0:5, :]

,거래금액,지역코드,아파트,시도명,시군구,법정동,지번,건축년도,년,월,일,전용면적,층
0,100500,11680,삼익대청아파트,서울특별시,강남구,개포동,12,1992,2020,1,31,39.530,13
1,203000,11680,개포자이,서울특별시,강남구,개포동,12-2,2004,2020,1,6,134.300,17
2,180000,11680,개포주공6단지,서울특별시,강남구,개포동,185,1983,2020,1,14,60.130,14
3,285000,11680,디에이치아너힐즈,서울특별시,강남구,개포동,1281,2019,2020,1,4,94.290,12
4,171000,11680,개포주공7단지,서울특별시,강남구,개포동,185,1983,2020,1,12,60.760,2
5,188000,11680,래미안블레스티지,서울특별시,강남구,개포동,1280,2019,2020,1,17,59.897,4

In [47]:
apt.dtypes

거래금액      int64
지역코드      int64
아파트      object
시도명      object
시군구      object
법정동      object
지번       object
건축년도      int64
년         int64
월         int64
일         int64
전용면적    float64
층         int64
dtype: object

In [48]:
apt.dtypes == 'int64'

거래금액     True
지역코드     True
아파트     False
시도명     False
시군구     False
법정동     False
지번      False
건축년도     True
년        True
월        True
일        True
전용면적    False
층        True
dtype: bool

In [50]:
apt.loc[:, apt.dtypes == 'int64']

          거래금액   지역코드  건축년도     년   월   일   층
0       100500  11680  1992  2020   1  31  13
1       203000  11680  2004  2020   1   6  17
2       180000  11680  1983  2020   1  14  14
3       285000  11680  2019  2020   1   4  12
4       171000  11680  1983  2020   1  12   2
...        ...    ...   ...   ...  ..  ..  ..
231899   74000  11260  1998  2024  11  21  11
231900   50500  11260  1995  2024  11  13  10
231901   60000  11260  1997  2024  11  18   4
231902   67000  11260  1998  2024  11   2   9
231903   11000  11260  2012  2024  12   7  15

[231904 rows x 7 columns]

In [52]:
apt.loc[:, (apt.dtypes == 'int64') | (apt.dtypes == 'float64')]

          거래금액   지역코드  건축년도     년   월   일    전용면적   층
0       100500  11680  1992  2020   1  31   39.53  13
1       203000  11680  2004  2020   1   6  134.30  17
2       180000  11680  1983  2020   1  14   60.13  14
3       285000  11680  2019  2020   1   4   94.29  12
4       171000  11680  1983  2020   1  12   60.76   2
...        ...    ...   ...   ...  ..  ..     ...  ..
231899   74000  11260  1998  2024  11  21   84.03  11
231900   50500  11260  1995  2024  11  13   59.34  10
231901   60000  11260  1997  2024  11  18   59.76   4
231902   67000  11260  1998  2024  11   2   59.76   9
231903   11000  11260  2012  2024  12   7   17.94  15

[231904 rows x 8 columns]

In [53]:
apt.select_dtypes(include = [int, float])

          거래금액   지역코드  건축년도     년   월   일    전용면적   층
0       100500  11680  1992  2020   1  31   39.53  13
1       203000  11680  2004  2020   1   6  134.30  17
2       180000  11680  1983  2020   1  14   60.13  14
3       285000  11680  2019  2020   1   4   94.29  12
4       171000  11680  1983  2020   1  12   60.76   2
...        ...    ...   ...   ...  ..  ..     ...  ..
231899   74000  11260  1998  2024  11  21   84.03  11
231900   50500  11260  1995  2024  11  13   59.34  10
231901   60000  11260  1997  2024  11  18   59.76   4
231902   67000  11260  1998  2024  11   2   59.76   9
231903   11000  11260  2012  2024  12   7   17.94  15

[231904 rows x 8 columns]

In [54]:
apt.columns

Index(['거래금액', '지역코드', '아파트', '시도명', '시군구', '법정동', '지번', '건축년도', '년', '월', '일',
       '전용면적', '층'],
      dtype='object')

In [57]:
# str accessor(접근자): 시리즈 또는 인덱스 원소별로 문자열을 처리하는 함수를 갖는 객체(모듈)
apt.loc[:, apt.columns.str.contains(pat = '년|월|일')]

        건축년도     년   월   일
0       1992  2020   1  31
1       2004  2020   1   6
2       1983  2020   1  14
3       2019  2020   1   4
4       1983  2020   1  12
...      ...   ...  ..  ..
231899  1998  2024  11  21
231900  1995  2024  11  13
231901  1997  2024  11  18
231902  1998  2024  11   2
231903  2012  2024  12   7

[231904 rows x 4 columns]

In [58]:
# '\n'은 줄바꿈(new line), '\t'은 탭(tab)
strs = pd.Series(data = ['ABCD', 'abcd', '1234', '가나다라', 'ㅋㅋㅎㅎ', 'ㅜㅜㅠㅠ', ' \n\t\\'])
strs

0      ABCD
1      abcd
2      1234
3      가나다라
4      ㅋㅋㅎㅎ
5      ㅜㅜㅠㅠ
6     \n\t\
dtype: object

In [59]:
strs.str.len()

0    4
1    4
2    4
3    4
4    4
5    4
6    4
dtype: int64

In [60]:
strs.str.extract(pat = r'([A-Z]+)')

      0
0  ABCD
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN

In [61]:
strs.str.extract(pat = r'([a-z]+)')

      0
0   NaN
1  abcd
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN

In [62]:
strs.str.extract(pat = r'([0-9]+)')

      0
0   NaN
1   NaN
2  1234
3   NaN
4   NaN
5   NaN
6   NaN

In [63]:
strs.str.extract(pat = r'([가-힣]+)')

      0
0   NaN
1   NaN
2   NaN
3  가나다라
4   NaN
5   NaN
6   NaN

In [64]:
strs.str.extract(pat = r'([ㄱ-ㅎ]+)')

      0
0   NaN
1   NaN
2   NaN
3   NaN
4  ㅋㅋㅎㅎ
5   NaN
6   NaN

In [65]:
strs.str.extract(pat = r'([ㅏ-ㅣ]+)')

      0
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5  ㅜㅜㅠㅠ
6   NaN

In [70]:
tels = pd.Series(data = ['010-2345-6789', '010-3456-7890', '02-345-6789', '123456-7890123'])

In [71]:
tels.str.extract(pat = r'(010-[0-9]{4}-[0-9]{4})')

               0
0  010-2345-6789
1  010-3456-7890
2            NaN
3            NaN

In [72]:
tels.str.extract(pat = r'(0[0-9]{1,2}-[0-9]{3,4}-[0-9]{4})')

               0
0  010-2345-6789
1  010-3456-7890
2    02-345-6789
3            NaN

In [73]:
tels.str.replace(pat = r'(0[0-9]{1,2}-[0-9]{3,4}-[0-9]{4})', repl = '', regex = True)

0
1
2
3    123456-7890123
dtype: object

In [78]:
addr = pd.Series(data = ['서울특별시 강남구 역삼동 1', '인천광역시 계양구 서운동 2', '경기도 성남시 분당구 이매동 3'])

In [77]:
addr.str.extract(pat = r'([가-힣]+)')

       0
0  서울특별시
1  인천광역시
2    경기도

In [79]:
prod = pd.Series(data = ['45ABC-DFG', '55AEF-JKE', 'OLED85AED-JKI'])

In [80]:
prod.str.extract(pat = r'([0-9]+)')

    0
0  45
1  55
2  85

In [83]:
prod.str.extract(pat = r'([A-Z]+)')

      0
0   ABC
1   AEF
2  OLED

In [82]:
prod.str.extract(pat = r'((?<=\d)[A-Z]+)')

     0
0  ABC
1  AEF
2  AED

In [84]:
prod.str.extract(pat = r'([A-Z]+$)')

     0
0  DFG
1  JKE
2  JKI

In [85]:
tels

0     010-2345-6789
1     010-3456-7890
2       02-345-6789
3    123456-7890123
dtype: object

In [86]:
tels.str[0]

0    0
1    0
2    0
3    1
dtype: object

In [87]:
tels.str[0:2]

0    01
1    01
2    02
3    12
dtype: object

In [89]:
tels.str.split(pat = '-')

0    [010, 2345, 6789]
1    [010, 3456, 7890]
2      [02, 345, 6789]
3    [123456, 7890123]
dtype: object

In [90]:
tels.str.split(pat = '-').str[0]

0       010
1       010
2        02
3    123456
dtype: object

In [92]:
tels.str.replace(pat = '-', repl = '=')

0     010=2345=6789
1     010=3456=7890
2       02=345=6789
3    123456=7890123
dtype: object

In [93]:
tels.str.extract(pat = r'([0-9]+)')

        0
0     010
1     010
2      02
3  123456

In [94]:
tels.str.extract(pat = r'([0-9]+$)')

         0
0     6789
1     7890
2     6789
3  7890123

In [95]:
# 글로벌 변수 목록을 보여주는 매직 커맨드
%whos

Variable   Type         Data/Info
---------------------------------
addr       Series       0      서울특별시 강남구 역삼동 1\n1<...> 분당구 이매동 3\ndtype: object
apt        DataFrame              거래금액   지역코드    <...>231904 rows x 13 columns]
cond       Series       0          True\n1       <...>ngth: 231904, dtype: bool
na         DataFrame        구분 항목     값\n0    A  <...> b  2.60\n5  NaN  c  3.60
np         module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
os         module       <module 'os' (frozen)>
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>
prod       Series       0        45ABC-DFG\n1    <...>D85AED-JKI\ndtype: object
strs       Series       0      ABCD\n1      abcd\<...>     \n\t\\ndtype: object
tels       Series       0     010-2345-6789\n1   <...>56-7890123\ndtype: object

In [96]:
%whos -v DataFrame

Variable   Type         Data/Info
---------------------------------
apt        DataFrame              거래금액   지역코드    <...>231904 rows x 13 columns]
na         DataFrame        구분 항목     값\n0    A  <...> b  2.60\n5  NaN  c  3.60

In [103]:
na.to_csv('test.csv', encoding = 'CP949', sep = '\t', index = False)

In [105]:
na1 = pd.read_csv('test.csv', encoding = 'CP949', sep = '\t')
na1

    구분 항목     값
0    A  a  1.20
1  NaN  b  2.30
2  NaN  c  2.28
3    B  a  1.70
4  NaN  b  2.60
5  NaN  c  3.60